MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/dacc.h
/* -------- DACC_IDR : (DACC Offset: 0x28) ( /W 32) Interrupt Disable Register -------- */
#define DACC_IDR_TXRDY0_Pos                   _UINT32_(0)                                          /* (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Position */
#define DACC_IDR_TXRDY0_Msk                   (_UINT32_(0x1) << DACC_IDR_TXRDY0_Pos)               /* (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Mask */
#define DACC_IDR_TXRDY0(value)                (DACC_IDR_TXRDY0_Msk & (_UINT32_(value) << DACC_IDR_TXRDY0_Pos)) /* Assignment of value for TXRDY0 in the DACC_IDR register */
#define DACC_IDR_TXRDY1_Pos                   _UINT32_(1)                                          /* (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Position */
#define DACC_IDR_TXRDY1_Msk                   (_UINT32_(0x1) << DACC_IDR_TXRDY1_Pos)               /* (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Mask */
#define DACC_IDR_TXRDY1(value)                (DACC_IDR_TXRDY1_Msk & (_UINT32_(value) << DACC_IDR_TXRDY1_Pos)) /* Assignment of value for TXRDY1 in the DACC_IDR register */
#define DACC_IDR_EOC0_Pos                     _UINT32_(4)                                          /* (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Position */
#define DACC_IDR_EOC0_Msk                     (_UINT32_(0x1) << DACC_IDR_EOC0_Pos)                 /* (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Mask */
#define DACC_IDR_EOC0(value)                  (DACC_IDR_EOC0_Msk & (_UINT32_(value) << DACC_IDR_EOC0_Pos)) /* Assignment of value for EOC0 in the DACC_IDR register */
#define DACC_IDR_EOC1_Pos                     _UINT32_(5)                                          /* (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Position */
#define DACC_IDR_EOC1_Msk                     (_UINT32_(0x1) << DACC_IDR_EOC1_Pos)                 /* (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Mask */
#define DACC_IDR_EOC1(value)                  (DACC_IDR_EOC1_Msk & (_UINT32_(value) << DACC_IDR_EOC1_Pos)) /* Assignment of value for EOC1 in the DACC_IDR register */
#define DACC_IDR_Msk                          _UINT32_(0x00000033)                                 /* (DACC_IDR) Register Mask  */

#define DACC_IDR_TXRDY_Pos                    _UINT32_(0)                                          /* (DACC_IDR Position) Transmit Ready Interrupt Disable of channel x */
#define DACC_IDR_TXRDY_Msk                    (_UINT32_(0x3) << DACC_IDR_TXRDY_Pos)                /* (DACC_IDR Mask) TXRDY */
#define DACC_IDR_TXRDY(value)                 (DACC_IDR_TXRDY_Msk & (_UINT32_(value) << DACC_IDR_TXRDY_Pos)) 
#define DACC_IDR_EOC_Pos                      _UINT32_(4)                                          /* (DACC_IDR Position) End of Conversion Interrupt Disable of channel x */
#define DACC_IDR_EOC_Msk                      (_UINT32_(0x3) << DACC_IDR_EOC_Pos)                  /* (DACC_IDR Mask) EOC */
#define DACC_IDR_EOC(value)                   (DACC_IDR_EOC_Msk & (_UINT32_(value) << DACC_IDR_EOC_Pos)) 

/* -------- DACC_IMR : (DACC Offset: 0x2C) ( R/ 32) Interrupt Mask Register -------- */
#define DACC_IMR_TXRDY0_Pos                   _UINT32_(0)                                          /* (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Position */
#define DACC_IMR_TXRDY0_Msk                   (_UINT32_(0x1) << DACC_IMR_TXRDY0_Pos)               /* (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Mask */
#define DACC_IMR_TXRDY0(value)                (DACC_IMR_TXRDY0_Msk & (_UINT32_(value) << DACC_IMR_TXRDY0_Pos)) /* Assignment of value for TXRDY0 in the DACC_IMR register */
#define DACC_IMR_TXRDY1_Pos                   _UINT32_(1)                                          /* (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Position */
#define DACC_IMR_TXRDY1_Msk                   (_UINT32_(0x1) << DACC_IMR_TXRDY1_Pos)               /* (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Mask */
#define DACC_IMR_TXRDY1(value)                (DACC_IMR_TXRDY1_Msk & (_UINT32_(value) << DACC_IMR_TXRDY1_Pos)) /* Assignment of value for TXRDY1 in the DACC_IMR register */
#define DACC_IMR_EOC0_Pos                     _UINT32_(4)                                          /* (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Position */
#define DACC_IMR_EOC0_Msk                     (_UINT32_(0x1) << DACC_IMR_EOC0_Pos)                 /* (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Mask */
#define DACC_IMR_EOC0(value)                  (DACC_IMR_EOC0_Msk & (_UINT32_(value) << DACC_IMR_EOC0_Pos)) /* Assignment of value for EOC0 in the DACC_IMR register */
#define DACC_IMR_EOC1_Pos                     _UINT32_(5)                                          /* (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Position */
#define DACC_IMR_EOC1_Msk                     (_UINT32_(0x1) << DACC_IMR_EOC1_Pos)                 /* (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Mask */
#define DACC_IMR_EOC1(value)                  (DACC_IMR_EOC1_Msk & (_UINT32_(value) << DACC_IMR_EOC1_Pos)) /* Assignment of value for EOC1 in the DACC_IMR register */
#define DACC_IMR_Msk                          _UINT32_(0x00000033)                                 /* (DACC_IMR) Register Mask  */

#define DACC_IMR_TXRDY_Pos                    _UINT32_(0)                                          /* (DACC_IMR Position) Transmit Ready Interrupt Mask of channel x */
#define DACC_IMR_TXRDY_Msk                    (_UINT32_(0x3) << DACC_IMR_TXRDY_Pos)                /* (DACC_IMR Mask) TXRDY */
#define DACC_IMR_TXRDY(value)                 (DACC_IMR_TXRDY_Msk & (_UINT32_(value) << DACC_IMR_TXRDY_Pos)) 
#define DACC_IMR_EOC_Pos                      _UINT32_(4)                                          /* (DACC_IMR Position) End of Conversion Interrupt Mask of channel x */
#define DACC_IMR_EOC_Msk                      (_UINT32_(0x3) << DACC_IMR_EOC_Pos)                  /* (DACC_IMR Mask) EOC */
#define DACC_IMR_EOC(value)                   (DACC_IMR_EOC_Msk & (_UINT32_(value) << DACC_IMR_EOC_Pos)) 

