MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/dacc.h
/* DACC register offsets definitions */
#define DACC_CR_REG_OFST               _UINT32_(0x00)      /* (DACC_CR) Control Register Offset */
#define DACC_MR_REG_OFST               _UINT32_(0x04)      /* (DACC_MR) Mode Register Offset */
#define DACC_TRIGR_REG_OFST            _UINT32_(0x08)      /* (DACC_TRIGR) Trigger Register Offset */
#define DACC_CHER_REG_OFST             _UINT32_(0x10)      /* (DACC_CHER) Channel Enable Register Offset */
#define DACC_CHDR_REG_OFST             _UINT32_(0x14)      /* (DACC_CHDR) Channel Disable Register Offset */
#define DACC_CHSR_REG_OFST             _UINT32_(0x18)      /* (DACC_CHSR) Channel Status Register Offset */
#define DACC_CDR_REG_OFST              _UINT32_(0x1C)      /* (DACC_CDR) Conversion Data Register 0 Offset */
#define DACC_CDR0_REG_OFST             _UINT32_(0x1C)      /* (DACC_CDR0) Conversion Data Register 0 Offset */
#define DACC_CDR1_REG_OFST             _UINT32_(0x20)      /* (DACC_CDR1) Conversion Data Register 0 Offset */
#define DACC_IER_REG_OFST              _UINT32_(0x24)      /* (DACC_IER) Interrupt Enable Register Offset */
#define DACC_IDR_REG_OFST              _UINT32_(0x28)      /* (DACC_IDR) Interrupt Disable Register Offset */
#define DACC_IMR_REG_OFST              _UINT32_(0x2C)      /* (DACC_IMR) Interrupt Mask Register Offset */
#define DACC_ISR_REG_OFST              _UINT32_(0x30)      /* (DACC_ISR) Interrupt Status Register Offset */
#define DACC_ACR_REG_OFST              _UINT32_(0x94)      /* (DACC_ACR) Analog Current Register Offset */
#define DACC_WPMR_REG_OFST             _UINT32_(0xE4)      /* (DACC_WPMR) Write Protection Mode Register Offset */
#define DACC_WPSR_REG_OFST             _UINT32_(0xE8)      /* (DACC_WPSR) Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* DACC register API structure */
typedef struct
{
  __O   uint32_t                       DACC_CR;            /* Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       DACC_MR;            /* Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       DACC_TRIGR;         /* Offset: 0x08 (R/W  32) Trigger Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       DACC_CHER;          /* Offset: 0x10 ( /W  32) Channel Enable Register */
  __O   uint32_t                       DACC_CHDR;          /* Offset: 0x14 ( /W  32) Channel Disable Register */
  __I   uint32_t                       DACC_CHSR;          /* Offset: 0x18 (R/   32) Channel Status Register */
  __O   uint32_t                       DACC_CDR[2];        /* Offset: 0x1C ( /W  32) Conversion Data Register 0 */
  __O   uint32_t                       DACC_IER;           /* Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       DACC_IDR;           /* Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       DACC_IMR;           /* Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       DACC_ISR;           /* Offset: 0x30 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x60];
  __IO  uint32_t                       DACC_ACR;           /* Offset: 0x94 (R/W  32) Analog Current Register */
  __I   uint8_t                        Reserved3[0x4C];
  __IO  uint32_t                       DACC_WPMR;          /* Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       DACC_WPSR;          /* Offset: 0xE8 (R/   32) Write Protection Status Register */
} dacc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZMC70_DACC_COMPONENT_H_ */
